app/controllers/customers_controller.rb

INSERT INTO "customers" ("name", "address", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "John Doe"], ["address", "456 Elm St, Othertown, OT"], ["created_at", "2023-11-12 20:44:17.337809"], ["updated_at", "2023-11-12 20:44:17.337809"]]
---
  def create
    customer = Customer.new(customer_params)

    if customer.save