app/controllers/warehouses_controller.rb

  def create
    warehouse = Warehouse.new(warehouse_params)

    if warehouse.save
---
INSERT INTO "warehouses" ("name", "location", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Central Warehouse"], ["location", "123 Main St, Anytown, AN"], ["created_at", "2023-11-12 20:48:03.379826"], ["updated_at", "2023-11-12 20:48:03.379826"]]

  def distance_to_customer
    warehouse = Warehouse.find(params[:warehouse_id])
    customer = Customer.find(params[:customer_id])
---
SELECT "customers".* FROM "customers" WHERE "customers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]